---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalDefinition
source: html/cdd74bfc-e0fa-6240-088c-28db47f76039.htm
---
# ExternalDefinition Members

Releases all resources used by the ExternalDefinition